html/20231214T060637--authenticate-to-git-with-personal-access-token__git.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>authenticate to git with personal access token</title>
header - stylesheets and stuff here</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br?</div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231214T060637--authenticate-to-git-with-personal-access-token__git.html">authenticate to git with personal access token</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org746ce1d">1. Personal access token</a></li>
<li><a href="#org9b31356">2. Misc info</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org746ce1d" class="outline-2">
<h2 id="org746ce1d"><span class="section-number-2">1.</span> Personal access token</h2>
<div class="outline-text-2" id="text-1">
<p>
After you have <a href="20231211T161252--introduce-yourself-to-git__git.html">introduced yourself to git</a>.
</p>

<p>
When you do a git operation(with magit or just from the terminal) you will be
prompted for password. One way is to get with a generated <code>personal access
token</code> in github developer settings.
</p>

<p>
Go generate that token, save it somewhere safe.
</p>

<p>
Then in the terminal do:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --global --replace-all credential.helper cache
git config --global credential.helper store
</pre>
</div>

<p>
Now try to push the code, enter your git username as username and enter the
token that you have generated as password.
</p>

<p>
Git will remember your credentials for future git operations.
</p>
</div>
</div>

<div id="outline-container-org9b31356" class="outline-2">
<h2 id="org9b31356"><span class="section-number-2">2.</span> Misc info</h2>
<div class="outline-text-2" id="text-2">
<p>
Changing the token - <a href="https://stackoverflow.com/questions/46645843/where-to-store-my-git-personal-access-token">Explanation here</a>.
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --list (some info about you)
</pre>
</div>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-git.html">git</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
